
  
    const 前端_基础 = [["/1_前端/1_基础/","简介"],["/1_前端/1_基础/CSS","CSS"],["/1_前端/1_基础/HTML","HTML"],["/1_前端/1_基础/JS","JS"],["/1_前端/1_基础/Typescript","Typescript"],["/1_前端/1_基础/网络","网络"]]
  
    const 前端_框架 = [["/1_前端/2_框架/","简介"],["/1_前端/2_框架/1_VUE_数据双向绑定/","VUE"],["/1_前端/2_框架/Angular","Angular"],["/1_前端/2_框架/Gitbook","Gitbook"],["/1_前端/2_框架/Jquery","Jquery"],["/1_前端/2_框架/Node","Node"],["/1_前端/2_框架/React","React"],["/1_前端/2_框架/ReactNative","ReactNative"],["/1_前端/2_框架/Vue","Vue"],["/1_前端/2_框架/Vuepress","Vuepress"],["/1_前端/2_框架/小程序","小程序"]]
  
    const 前端_文档 = [["/1_前端/3_文档/","简介"],{"title":"面试","collapsable":false,"children":[["/1_前端/3_文档/1_面试/","简介"],["/1_前端/3_文档/1_面试/CSS","CSS"],["/1_前端/3_文档/1_面试/HTTP","HTTP"],["/1_前端/3_文档/1_面试/JS","JS"],["/1_前端/3_文档/1_面试/Node","Node"],["/1_前端/3_文档/1_面试/Typescript","Typescript"],["/1_前端/3_文档/1_面试/工程化","工程化"],["/1_前端/3_文档/1_面试/框架","框架"],["/1_前端/3_文档/1_面试/浏览器","浏览器"]]},["/1_前端/3_文档/WIKI","WIKI"],["/1_前端/3_文档/周刊","周刊"],["/1_前端/3_文档/感悟","感悟"],["/1_前端/3_文档/招聘","招聘"],["/1_前端/3_文档/英文词汇","英文词汇"],["/1_前端/3_文档/资源","资源"]]
  
    const 前端_工具 = [["/1_前端/4_工具/","简介"],["/1_前端/4_工具/工具链","工具链"],["/1_前端/4_工具/浏览器","浏览器"]]
  
    const 前端_监控 = [["/1_前端/5_监控/","简介"]]
  
    const 前端_工程化 = [["/1_前端/6_工程化/","简介"]]
  
    const 前端_资源 = [["/1_前端/7_资源/","简介"]]
  
    const 前端_大数据分析 = [["/1_前端/8_大数据分析/","简介"]]
  
    const 后台_JAVA = [["/2_后台/1_JAVA/","简介"]]
  
    const 后台_PYTHON = [["/2_后台/2_PYTHON/","简介"]]
  
    const 后台_Go = [["/2_后台/3_Go/","简介"]]
  
    const 后台_Node = [["/2_后台/4_Node/","简介"]]
  
    const 工具_DOCKER = [["/3_工具/1_DOCKER/","简介"],{"title":"镜像","collapsable":false,"children":[["/3_工具/1_DOCKER/1_镜像/","简介"],["/3_工具/1_DOCKER/1_镜像/Gitlab","Gitlab"],["/3_工具/1_DOCKER/1_镜像/Nginx","Nginx"],["/3_工具/1_DOCKER/1_镜像/PHP","PHP"]]}]
  
    const 工具_VSCODE = [["/3_工具/2_VSCODE/","简介"]]
  
    const 工具_Markdown = [["/3_工具/3_Markdown/","简介"]]
  
    const 工具_Photoshop = [["/3_工具/4_Photoshop/","简介"]]
  
    const 工具_Shell = [["/3_工具/5_Shell/","简介"]]
  
    const 工具_VPN = [["/3_工具/6_VPN/","简介"]]
  
    const 工具_Github = [["/3_工具/7_Github/","简介"]]
  
    const 系统_Window = [["/4_系统/1_Window/","简介"]]
  
    const 系统_Linux = [["/4_系统/2_Linux/","简介"]]
  
    const 系统_Mac = [["/4_系统/3_Mac/","简介"]]
  
    const 系统_IPHONE = [["/4_系统/4_IPHONE/","简介"]]
  
    const 生活_考试 = [["/5_生活/1_考试/","简介"],{"title":"在职MBA","collapsable":false,"children":[["/5_生活/1_考试/1_在职MBA/","简介"],["/5_生活/1_考试/1_在职MBA/北京理工大学","北京理工大学"],["/5_生活/1_考试/1_在职MBA/华中科技大学","华中科技大学"],["/5_生活/1_考试/1_在职MBA/武汉大学","武汉大学"]]},["/5_生活/1_考试/国考","国考"],["/5_生活/1_考试/职称考试","职称考试"],["/5_生活/1_考试/证券从业资格考试","证券从业资格考试"]]
  
    const 生活_思考 = [["/5_生活/2_思考/","简介"]]
  
    const 生活_常识 = [["/5_生活/3_常识/","简介"]]
  
    const 生活_历史 = [["/5_生活/4_历史/","简介"]]
  
  module.exports = {
    
      "/1_前端/1_基础/": 前端_基础,
    
      "/1_前端/2_框架/": 前端_框架,
    
      "/1_前端/3_文档/": 前端_文档,
    
      "/1_前端/4_工具/": 前端_工具,
    
      "/1_前端/5_监控/": 前端_监控,
    
      "/1_前端/6_工程化/": 前端_工程化,
    
      "/1_前端/7_资源/": 前端_资源,
    
      "/1_前端/8_大数据分析/": 前端_大数据分析,
    
      "/2_后台/1_JAVA/": 后台_JAVA,
    
      "/2_后台/2_PYTHON/": 后台_PYTHON,
    
      "/2_后台/3_Go/": 后台_Go,
    
      "/2_后台/4_Node/": 后台_Node,
    
      "/3_工具/1_DOCKER/": 工具_DOCKER,
    
      "/3_工具/2_VSCODE/": 工具_VSCODE,
    
      "/3_工具/3_Markdown/": 工具_Markdown,
    
      "/3_工具/4_Photoshop/": 工具_Photoshop,
    
      "/3_工具/5_Shell/": 工具_Shell,
    
      "/3_工具/6_VPN/": 工具_VPN,
    
      "/3_工具/7_Github/": 工具_Github,
    
      "/4_系统/1_Window/": 系统_Window,
    
      "/4_系统/2_Linux/": 系统_Linux,
    
      "/4_系统/3_Mac/": 系统_Mac,
    
      "/4_系统/4_IPHONE/": 系统_IPHONE,
    
      "/5_生活/1_考试/": 生活_考试,
    
      "/5_生活/2_思考/": 生活_思考,
    
      "/5_生活/3_常识/": 生活_常识,
    
      "/5_生活/4_历史/": 生活_历史,
    
  }
